index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://hnvy.github.io/css/main.css" />
</head>
<body>
<div id="content">
<pre>
<code>> ./index.html</code>
</pre>

<p>
<a href="html/about.html">About</a> - <a href="html/archive.html">Archive</a> - <a href="rss.xml">RSS feed</a>
</p>

<p>
<p><a href="https://github.com/hnvy/hnvy.github.io/edit/main/index.html">ESotP</a></p>
</p>

<p>
<hr>
</p>

<div id="outline-container-org687c993" class="outline-2">
<h2 id="hnvy"><a id="org687c993"></a>hnvy.github.io</h2>
<div class="outline-text-2" id="text-hnvy">
<p>
This site is for me to document my thoughts, ideas, and progress. It is composed of nothing but HTML and simple CSS. No Javascript, no analytics, no cookies, no advertisement, no nothing. Just text and, sometimes, pictures. Think of it as a personal Wiki page of a young learner rather than a blog&#x2026;
</p>
</div>
</div>

<div id="outline-container-org245df5c" class="outline-2">
<h2 id="esotp"><a id="org245df5c"></a>Edit Something on this Page (ESoTP)</h2>
<div class="outline-text-2" id="text-esotp">
<p>
This website exists solely to demonstrate that being a novice is perfectly OK, and that novices make mistakes (lots of them). Every page on this site will have a hyperlink, at the top, to allow you to Edit Something on this Page (ESoTP). This is a call to action for you to identify any errors (any errors) in my work, fix them, and send pull requests.
</p>
</div>
</div>

<div id="outline-container-org78010e5" class="outline-2">
<h2 id="subdomains"><a id="org78010e5"></a>Subdomains</h2>
<div class="outline-text-2" id="text-subdomains">
<ul class="org-ul">
<li><a href="https://hnvy.github.io/blog-1/">blog-1</a></li>
</ul>

<p>
<hr style="width:75%;">
</p>

<footer style="font-size: 0.75em; font-style: italic; text-align: center; padding: 1em 20em 0em 20em;">
<p>Unless otherwise noted, every original piece of writing/artwork on <a href="https://hnvy.github.io/">this site</a> is licensed under <a href="http://creativecommons.org/licenses/by-sa/4.0/">CC BY-SA 4.0</a>, and all code snippets are licensed under <a href="https://www.gnu.org/licenses/gpl-3.0.html">GPLv3+</a>.</p>

<p>Please note that the content on this site is NOT intended to be used as a diagnostic or treatment tool. If you are having any symptoms, you should always seek professional medical attention. My notes are NOT intended to be medical advice; you should seek guidance from your physician rather than the internet. Once again, this document is NOT for medical advice! In fact, NONE of this site's information should be taken as advice, because the content on this site may NOT be applicable to you.</p>
</footer>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>
<p class="validation"></p>
</div>
</body>
</html>
